app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hola mundo"], ["user_id", 6], ["created_at", "2021-01-02 22:10:07.131903"], ["updated_at", "2021-01-02 22:10:07.131903"]]

  def update
    if @book.name != "Global"
      respond_to do |format|
        if @book.update(book_params)
---
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "Libro nuevo"], ["updated_at", "2021-01-26 18:43:39.082562"], ["id", 28]]