app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("name", "content", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "kaka"], ["content", "asdfghjklñ"], ["book_id", 26], ["created_at", "2021-01-02 22:11:42.343718"], ["updated_at", "2021-01-02 22:11:42.343718"]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "name" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["name", "Nombre no nulo"], ["updated_at", "2021-01-26 18:58:48.963569"], ["id", 127]]

    def my_books
      current_user.books.map{|book| [book.name, book.id]}
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]