app/models/note.rb

	scope :empty, -> (book_id){where("book_id == ?", book_id).delete_all}
---
DELETE FROM "notes" WHERE (book_id == 26)