app/controllers/users/registrations_controller.rb

  def create
     super
     Book.create(name: "Global", user_id: current_user.id)
---
INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password") VALUES (?, ?, ?, ?)
INSERT INTO "books" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Global"], ["user_id", 6], ["created_at", "2021-01-02 22:09:53.190089"], ["updated_at", "2021-01-02 22:09:53.190089"]]